examples/dae21-delta-local/input/case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         20.0;

deltaT          0.05;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

allowSystemOperations 1;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;

        libs            (forces);

        writeControl    timeStep;
        writeInterval   1;

        log             yes;

        patches         (solid);
        rho             rhoInf;      // Indicates incompressible
        rhoInf          1.225;           // Required when rho = rhoInf
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0.375 0 0);  // Axle midpoint on ground
        pitchAxis       (0 1 0);
        magUInf         10;
        lRef            1.5;        // Wheelbase length
        Aref            0.7125;        // Estimated
    }
    
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;   // or use 'timeStep' for every timestep
    }
}

// ************************************************************************* //
